import numpy as np          # numpy库

# 使用numpy生成数组(矩阵),得到ndarray的类型
t1 = np.array([1,2,3])
print(t1)                   # [1 2 3]
print(type(t1))             # <class 'numpy.ndarray'>

t2 = np.array(range(4,7))
print(t2)                   # [4 5 6]
print(t2.dtype)             # int64                     # .dtype查看字节类型

t3 = np.arange(4,7,0.5)     # numpy自带的range,普通range只能生成整数,而arange可以生成浮点数序列
print(t3)                   # [4.  4.5 5.  5.5 6.  6.5]
print(t3.dtype)             # float64   # 64位浮点型

#dtype格式
t4 = np.array(range(4),dtype="float32")                 # 创建时可自定义字符类型       
print(t4,t4.dtype)          # [0. 1. 2. 3.] float32     # 32位浮点型字符

# astype() 调整数据类型
t5 = t4.astype("i1")       # 换了字符类型后，变量是被重构了，不是原来的对象了          # astype 中可以使用 "li" 这样的缩写也可以使用 "int8" 这样的完整写法
print(t5,t5.dtype)         # [0 1 2 3] int8             # 就像int(),如果有小数就直接截断,不会四舍五入

# 小扩展: i1(int8)     1字节的整数   , 范围: -128~127  ,i2(int16),  i4(int32) , i8(int68)
#        u1(uint8)    1字节无符号整数, 范围：0 ~ 255   ,u2(uint16), u4(uint32), u8(uint68)
#        f2(float16)  2字节的浮点型(半精度浮点)        ,f4(float32)单精度浮点   , f8(float68)双精度浮点（默认 float）
#        b (bool)     布尔类型,True / False
#        S10(string)  定长字节串，S10表示10个字节
#        U10(unicode) 定长Unicode字符串,10字符
#        c8(complex64)复数(两个float32)               ,c8(complex128) 复数(两个float64)

#-------------------------------------------------------------------------------------------------------------

# 数组的切片索引(向量)   [start,end,Step]
arr = np.array([10, 20, 30, 40, 50])
print(arr[0])            # 访问第一个元素               # 10
print(arr[-1])           # 访问最后一个元素             # 50
print(arr[1:4])          # 访问索引1到3的元素           # [20 30 40]
print(arr[:3])           # 访问前3个元素               # [10 20 30]
print(arr[::2])          # 每隔一个元素取一个           # [10 30 50]

# 小数操作
import random
t6 = np.array([random.random() for i in range(10)])
print(t6)               # [0.81213663 0.51084802 0.57953335 0.2814412  0.53890663 0.63206232......
t7 = np.round(t6,2)     # round 取2位小数,四舍五入
print(t7)               # [0.81 0.51 0.58 0.28 0.54 0.63 0.23 0.59 0.63 0.53]

# 查看数组的形状
t1 = np.arange(4)
print(t1.shape)         # (4,)          # 表示一维数组,长度为4
print(t1)
t2 = np.array([[1,2],[3,4]])            # 需要把列表都嵌套在一个列表中
print(t2)               # [[1 2] [3 4]]
print(t2.shape)         # (2, 2)        # 二维数组,2行2列

# 修改数组形状
t3 = t1.reshape(2,2)    # 修改数组形状
print(t3.shape)         # (2, 2)
print(t3)               # [[0 1],[2 3]]                   # t1变成了二维数组
t4 = np.array([[1,2,3,4],[4,5,6,7],[7,8,9,10]])           # Numpy数组的形状必须规则,形成长方形或正方形
print(t4.shape)         # (3, 4)

#--------------------------------------------------------------------------------------------------------------

# 三维+数组(块数,行数,列数)
t5 = np.arange(24).reshape((2,3,4))           # 三维数组  # 第一个2,指这个数组包含 2 个块（相当于 2 个 3×4 矩阵）。
t6 = t5.reshape(t5.shape[0]*t5.shape[1]*t5.shape[2],)    # 数据总量 = 块x行x列
print(t6)       # 三维转一维,数据总量不变,末尾需要加逗号

# .flatten()展开
print(t5.flatten())     # [ 0  1  2  3  4 ... 23]         # 将高维数组展开成一维向量


# 小扩展：标准视角里， 标量 是一个单独的数，      如 1，2，3 就是三个标量，维度是0
#                   向量 是一行或一列数，      如 [1,2,3] 或 [[1],[2],[3]]维度为1   
#                   矩阵 是行和列的二维表格，   如 [[1,2],[3,4]]维度为2
#                   张量 多个矩阵组成的块,     如[[[1,2],[3,4]],[[5,6],[7,8]]]....可以更高维度3+
# 但实际 向量 也可以看作是特殊的 矩阵 (n,1)/(1,m),而 n维矩阵，n维数组 其实也是在说是 n维张量。
# 张量（Tensor）就是最广泛的定义，矩阵是二维张量，向量是一维张量，标量是0维张量，而数组是编程语言的术语(统称所有维度的数据结构)
# 还有更麻的...这里的几维代表的是结构维度，而在机器学习中，维度则更多表示多少 m(列)，也就是 每个样本 n(行) 的特征数
# 到了模型的细分，又出现 xx通道，xx批 之类的语句

#----------------------------------------------------------------------------------------------------------

# numpy原生生成随机数组 
# randint(low, high, (size)): 生成范围内的整数,数值范围可自定义,默认low=0
t1 = np.random.randint(0, 100, (5, 5))                            # 最大值为99,最小值为0,生成5x5的数组

# uniform(low, high, (size)): 生成均匀分布的随机小数,数值范围也可以自定义,默认是 [0,1)
t1 = np.random.uniform(1,2,(3,3))

# random((size)): 生成 [0,1) 范围内的随机小数（默认 均匀分布),不能指定 low 和 high,只能生成 [0,1)
ti = np.random.random((3,3))                                      

# rand(size): 同样生成[0,1) 范围内的随机小数,且不能指定 low 和 high。但 size 需要以整数形式传入，不能用元组
t1 = np.random.rand(2,3)

# randn(size): 生成服从 标准正态分布(高斯分布) 的随机数(均值为 0，标准差为 1) 范围理论上为(−∞, +∞)，但大多在[−3, +3], size 也以整数形式传入。
t1 = np.random.randn(3, 4)

# 生成带步长的随机数,使用 choice 在指定数字集中抽取数字组合
t1 = np.arange(0,100,2)                                           # 步长为2,生成0到98的数字集
t2 = np.random.choice(t1, size=(2, 5))                            # 从数字集中随机挑选数字,组合成数组
t3 = np.random.choice(np.arange(0,100,2),size=(2,5))              # 或直接使用最简洁的格式,一切都在choice中进行

#--------------------------------------------------------------------------------------------------------

# 矩阵计算
# 1.整数计算(广播)
t1 = np.arange(24).reshape((4,6))
# print(t1+2)     # [[ 2  3......24 25]]          # +2被应用到了每一个数

# NaN（Not a Number） 和 inf（Infinity）
print(t1/0)       # [[nan inf......inf inf]]      # 同样应用到数组中的每一个元素,但数字无法与零相除，就会出现这种情况，应该避免

# 2.矩阵与矩阵间的计算
t1 = t1.flatten()
t2 = t1+2    

print(t1)           # [[ 0  1......21 22 23]]
print(t2)           # [[ 2  3......23 24 25]]
print(t1 + t2)      # [[ 2  4......44 46 48]]     # 与对应位置的数进行运算，格式一定要匹配，不然无法进行运算
print(t2 - t1)      # [[ 2  2...... 2  2  2]]
print(t2 * t1)      # [[ 0  3...... 483 528 575]]
print(t2 / t1)      # 有点长了哈，总之就是和对应位置进行运算，结果的shape不会发生改变

# 高纬矩阵运算，以块为单位,与对应数字进行运算
t1 = np.arange(24).reshape((3,2,4))         
t2 = np.arange(8).reshape(2,4)
print(t1)       # [[[ 0  1  2  3],[ 4  5  6  7]]......[[16 17 18 19],[20 21 22 23]]]
print(t2)       #  [[ 0  1  2  3],[ 4  5  6  7]]
print(t1 + t2)  # [[[ 0  2  4  6],[ 8 10 12 14]]......[[16 18 20 22],[24 26 28 30]]]
# 但同样讲究行列匹配，且遇到同维对象，也必须要格式一致进行对位运算

# 矩阵转置 .T (行变列，列变行)
A = np.array([[1, 2, 3], [4, 5, 6]])        # shape = (2,3)
A_T = A.T    # 或者 A.transpose()
print(A_T)   # [[1 4],[2 5],[3 6]]          # shape = (3,2)
# .T是transpose的快捷写法，只能用于二维数组，三维以上会报错，通常可以使用transpose(-1,-2)，意为转置末尾两个维度，而不是改变整个矩阵的形状

# 真正的矩阵乘法（点积 / 矩阵积 / 内积）
# 矩阵乘法（dot product）使用 @  或 np.dot() 计算：
t1 = np.array([[1,2,3],              # (2,3) 二维数组
              [4,5,6]])              # 行x列
t2 = np.array([[7,8],                # (3,2) 二维数组
               [9,10],
               [11,12]])             # 点积时,两个数组必须行列对应,t1的行数 = t2的列数
print(t1 @ t2)  # [[ 58  64], [139 154]]                 # (2,3) @ (3,2)
结果的形状: (前一个矩阵的行数 × 后一个矩阵的列数)              # (2,2)
print(t2 @ t1)  # [[ 39  54  69]......[ 59  82 105]]     # (3,2)   # 改变双方位置,虽然对象不变,结果却完全不同
# A x B != B x A

#-----------------------------------------------------------------------------------------------------------

# 矩阵的切片与索引操作
A = np.array([[1, 2, 3],
              [4, 5, 6],
              [7, 8, 9]])

# ":" 在前代表跨行 "———" asix=1 ,在后代表列 "|" asix=0 , ":"前后没有数，就默认取取全部
A[0]                            # 第0行 → [1 2 3]
A[1, 2]                         # 第1行第2列 → 6
A[:, 0]                         # 所有行的第0列 → [1 4 7]
A[:2, 1:]                       # 前两行，去掉第0列 → [[2 3], [5 6]]

# 数组的位置交换
A[:, [0, 2]] = A[:, [2, 0]]     # 第0行和第1行换位       

# 交换列时,":"放在后方,代表所有列
A[[0,1],:] = A[[1,0],:]         # 第0列和第一列换位            


# np.sum 求和
np.sum(A)             # 所有元素之和 → 45
np.sum(A, axis=0)     # 每列之和 → [12 15 18]
np.sum(A, axis=1)     # 每行之和 → [6 15 24]

# 条件筛选
A[A > 5]              # 提取大于5的元素 → [6 7 8 9]
A[A % 2 == 0]         # 提取偶数 → [2 4 6 8]

# 或直接去掉[]输出布尔矩阵(二值化)
bool_array = A > 5    # [[False False False]
                      #  [False False True]
                      #  [True  True  True]]

# 想把布尔值转成 0/1 的话,就修改数据编码,False会变成0,True变成1
binary = (A > 5).astype(int)

# 小例子
arr = np.random.rand(1000000)       # 生成 100 万个[0,1]之间的随机数
mean_500k = np.mean(arr[:500000])   # ":"前未设置参数,默认为 0 到 500000 ,计算前 500000 个数的均值
std_all = np.std(arr,ddof=0)        # 计算标准差，ddfo=0 无偏差
count = np.sum(arr > 0.5)     # 布尔判断将元素都化为 0 或 1,sum统计所有大于 0.5 的元素个数

# 若需求出判断目标的总和: a = np.sum(arr[arr > 0.5])                 # 布尔判断内置,筛选元素,再进行sum求和
print(f"前 500000 个数的均值: {mean_500k:.4f}")                    # 前 500000 个数的均值: 0.5005
print(f"整个数组的标准差: {std_all:.4f}")                           # 整个数组的标准差: 0.2887
print(f"大于 0.5 的元素个数: {count_gt_05}")                        # 大于 0.5 的元素个数: 499896
# size属性,直接调出数组对象中的元素总量
print(f"大于 0.5 的元素占比:{(count_gt_05 / arr.size):.1f}%")       # 大于 0.5 的元素占比:0.5%

# np.where(condition,x,y)：对于数组中每一个元素，如果满足 condition，就返回 x 对应位置的值；否则返回 y 对应位置的值。 用于条件筛选后定位索引或替换。
A = np.array([1, 2, 3, 4])
idx = np.where(A > 2)                    # 返回满足条件的索引 → (array([2, 3]),) 是索引，不是实数
new_A = np.where(A > 2, 100, A)          # 满足条件替换成100，否则保留原值,x 和 y 必须成对出现，否则无法进行

# np.unique()：返回数组中唯一值，可选返回计数
arr = np.array([1,2,2,3,3,3])
np.unique(arr, return_counts=True)  # ([1,2,3],[1,2,3])  返回了去重后的列表 和 每个唯一值在原数组中出现过的次数。


#--------------------------------------------------------------------------------------

# 合并矩阵
a = np.arange(6).reshape(2,3)           # [[0,1,2],[3,4,5]]                              shape = (2,3)

b = np.ones((a.shape[0],1)              #                                                shape = (2,1)
a_b = np.c_[a,b]                        # np.c_ 按列合并矩阵  [[0,1,2,1],[3,4,5,1]         shape = (2,4)

b = np.ones((1,a.shape[1]))             #                                                shape = (1,3)
a_b = np.r_[a,b]                        # np.r_ 按行合并矩阵  [[0,1,2],[3,4,5],[1,1,1]]    shape = (3,3)

#-------------------------------------------------------------------------------------------------------------

# 统计运算
data = np.array([5, 10, 15, 20, 25])
print("均值:", np.mean(data))      # 均值: 15.0                      # 计算均值
print("中位数:", np.median(data))  # 中位数: 15.0                    # 计算中位数
print("方差:", np.var(data))       # 方差: 50.0                      # 计算方差
print("标准差:", np.std(data))     # 标准差: 7.0710678118654755      # 计算标准差（衡量数据的波动程度）默认ddof=0,计算总体标准差，适用于完整数据集（整个总体）
                                                                    # 如果数据是样本（从总体中抽取的一部分）,建议使用 ddof=1，以修正样本偏差
print("最大值:",np.max(data))      # 最大值: 25
print("最小值:",np.min(data))      # 最小值: 5

#--------------------------------------------------------------------------------------------------------

#  单位矩阵（Identity Matrix）
I = np.eye(3)  # 生成 3×3 的单位矩阵
print(I)       # [[1. 0. 0.]             # 对角线全为 1，其余全为 0 的方阵(方形矩阵)，在矩阵运算(点积)中相当于“1”：
               #  [0. 1. 0.]
               #  [0. 0. 1.]]
t1 = np.arange(6).reshape(2,3)           # (0x1+1x0+2x0),(0x0+1x1+2x0)......(3x0+4x0+5x1)
print(t1 @ I)  # [[0. 1. 2.],[3. 4. 5.]] # 结果不变   # A×I = I×A = A


# 全零矩阵 & 全一矩阵
t1 = np.zeros(3)    # 也可以输入元组，指定生成 np.zero((3,3)) 之类的矩阵
print(t1)           # [0. 0. 0.]
t2 = np.ones(3)
print(t2)           # [1. 1. 1.]


# 逆矩阵（Inverse Matrix）A^-1 也就是 矩阵的倒数
# A x A^-1 = I     
# 只有 方阵（行数 = 列数） 才可能有逆矩阵,且不是所有方阵都有逆矩阵,如果行列式（det）= 0，矩阵就不可逆（称为奇异矩阵）
A = np.array([[1, 2],      # 定义一个 2×2 的可逆矩阵 A
              [3, 4]])
A_inv = np.linalg.inv(A)   # 求逆矩阵      # np.linalg是NumPy处理线性代数（Linear Algebra）的库
print("矩阵 A:\n", A)                     # inv()代表inverse（逆矩阵）
print("A 的逆矩阵:\n", A_inv)
C = A @ A_inv  # A 乘 A 的逆矩阵

# np.allclose(A, B):判断两个矩阵是否“接近相等”,允许浮点误差,误差默认为1e-08,适用于矩阵计算,不影响正常比较
print(np.allclose(C, np.eye(2)))  # True  # 生成2x2的单位矩阵来对比,得出A_inv就是A的逆矩阵


# 行列式（Determinant）
# 行列式是一个标量,表示矩阵的“大小”或“扩展比例”,在 判断矩阵是否可逆 时很重要：
# det(A) != 0 → 矩阵可逆
# det(A) = 0 → 矩阵不可逆（奇异矩阵）
A = np.array([[1, 2],
              [3, 4]])
det_A = np.linalg.det(A)  # det计算行列式

# 计算过程:det(A)=1×4−2×3=−2    # 主对角线乘积 - 副对角线乘积
print("A 的行列式:", det_A)    # A 的行列式:-2  # det不为零,矩阵可逆
B = np.array([[2, 4],
              [1, 2]])  # 行列式 = 2×2 - 4×1 = 0
det_B = np.linalg.det(B)
print("B 的行列式:", det_B)    # B 的行列式: 0.0       # 行列式为 0（矩阵不可逆）

# 特征值 & 特征向量（Eigenvalues & Eigenvectors）
# 对于一个方阵A,如果存在一个数𝜆和一个非零向量𝑣,使得:𝐴𝑣=𝜆𝑣,则𝜆是特征值（Eigenvalue),𝑣是对应的特征向量（Eigenvector）
A = np.array([[1, 2],
              [3, 4]])
# 计算特征值和特征向量
eigvals, eigvecs = np.linalg.eig(A)    # 用两个变量接收eig数组:特征值和特征向量
print("A 的特征值:\n", eigvals)         #  [-0.37228132  5.37228132]    # 𝜆1,𝜆2
print("A 的特征向量:\n", eigvecs)       # [[-0.82456484 -0.41597356],   # v1= [-0.82456484     v2= [-0.41597356
                                      #  [ 0.56576746 -0.90937671]]           0.56576746]          -0.90937671]
# 验证结果
v1 = eigvecs[:, 0]                   # 取第一个特征向量 v1
lambda1 = eigvals[0]                 # 取第一个特征值 𝜆1
Av1 = A @ v1                        # 计算 A * v1
lambda1_v1 = lambda1 * v1  # 计算 λ1 * v1
print("A @ v1:\n", Av1)             # [ 0.30697009 -0.21062466]     # 结果相同
print("λ1 * v1:\n", lambda1_v1)     # [ 0.30697009 -0.21062466]
# 将多维数组降维成特征值,特征向量确保变换后仍然是原来的数组,只是大小改变

# norm范数
# 生成一个 1000 维(这里的维指的是列) 的随机向量(1,1000)，值在 [-1, 1] 之间      # 无论多少维,列，行,一个矩阵始终都只是在表示一个点,只是数字多了些
x = np.random.uniform(-1, 1, 1000)

# 计算欧几里得范数 (L2 范数)              # 从原点到该数组的直线距离
l2_norm = np.linalg.norm(x, ord=2)     # 这个数值的大小反映了向量的整体能量（大小），通常比L1范数小，但比L∞范数大

# 计算 1-范数 (L1 范数)                  # 所有元素的绝对值相加,反映了向量所有分量的总幅度
l1_norm = np.linalg.norm(x, ord=1)     # ord 表示当前向量的阶数,用于指定计算哪种范数

# 计算无穷范数 (L∞ 范数)                 # 数组中最大的那个绝对值,反映了向量中最大数值的影响力
inf_norm = np.linalg.norm(x, ord=np.inf)

# ':.4f' 代表 保留 4 位小数，确保结果格式美观。
print(f"欧几里得范数 (L2): {l2_norm:.4f}")            # 欧几里得范数 (L2): 18.5227
print(f"1-范数 (L1): {l1_norm:.4f}")                 # 1-范数 (L1): 510.5341
print(f"无穷范数 (L∞): {inf_norm:.4f}")               # 无穷范数 (L∞): 0.9991

#--------------------------------------------------------------------------------------------------------

# 解方程:AX = B 或 X = A^-1 @ B
# A 是一个 n × n 的方阵（系数矩阵）
# B 是一个 n 维向量（常数项）
# X 是未知变量的向量（求解目标）
# {2x + y = 5  
# {x + 3y = 7
A = np.array([[2,1],[1,3]])             
B = np.array([5,7])
X = np.linalg.solve(A,b)              # np.linalg.solve 使用的是 LU分解 这类算法 AX = B，不会去求逆矩阵，因为求逆效率低效且稳定性差        
print(X)               # [1.6 1.8]    # x=1.6,y=1.8

#-------------------------------------------------------------------------------------------------------

# NumPy 向量化计算斐波那契序列：
# 斐波那契定义：F(0) = 0, F(1) = 1, 其余 F(n) = F(n−1) + F(n−2)
def fb(n):
    fib = np.zeros(n, dtype=int)        # 创建大小为n的全零的整型数组,np.zeros(shape)
    fib[1] = 1                          # 设置F(1) = 1
    for i in range(2, n):               # 从 F(2) 开始计算, F(1)和F(0)不会受到影响
        fib[i] = fib[i-1] + fib[i-2]    # 递推公式 F(n) = F(n-1) + F(n-2),且直接通过索引访问数组元素
    return fib
fib_10 = fb(10)     # 计算前 10 项
print(fib_10)       # [ 0  1  1  2  3  5  8 13 21 34]

# 读取文件
# np.loadtxt(fname, dtype=float, delimiter=None, skiprows=0, usecols=None, unpack=False)
# fname	文件名（路径），如 "data.txt"
# dtype	设定数据类型，默认为 float
# delimiter	分隔符，如 ","（CSV 文件用 ,）
# skiprows	跳过前 n 行（如跳过表头）
# usecols	指定要读取的列，如 [0,2] 只读取第 1、3 列
# unpack	是否转置数据（True 时按列拆分）
