# 列表 (List)
a = [1,2.5,'3',[4,5]]                                  # 将一串数据保存到一个变量中
b = []                                                 # 列表可以为空
print(a)                                               # [1, 2.5, '3', [4]]   (列表里可以保存各种数据类型)
print(b)                                               # []

# 索引
print(a[3][0])                                          # 4 (取出第 4 个值中的第 1 个值)索引从0开始计算

# 切片
print(a[0:3:2])                                         # [1, '3'] (取出第1到第4的值，步长为2)



# 添加元素

# 1,整体添加
b.append("hello")
print(b)                                                # ['hello']

# 2,分散添加(仅限可迭代对象:字符串,列表......)
b.extend("ld")
print(b)                                                # ['hello', 'l', 'd'] ("ld"字符串被拆分成一个个单独的字符)

# 3,指定位置添加
b.insert(1,'wor')
print(b)                                                # ['hello', 'wor', 'l', 'd'] 在原本索引[1]的插入
